app/controllers/tcos_controller.rb

INSERT INTO "tcos" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-07-12 06:40:50.508889"], ["updated_at", "2019-07-12 06:40:50.508889"]]
---
  def create
    session[:order_params] ||= {}
    @order = Tco.new(session[:order_params])
    if !session[:value].present?
      @order.current_step = @order.init_step
    else
      @order.current_step = session[:order_step]
    end
    session[:tco] = params
    session[:value] ||= {}
    session[:value].deep_merge!(session[:tco].to_enum.to_h) if session[:tco]
    if @order.valid?
      if params[:back_button]
        @order.previous_step
      elsif @order.last_step?
        if @order.save